testing/compressible/sonicFoam/laminar/forwardStep/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform (3 0 0);
    }

    outlet          
    {
        type            zeroGradient;
    }

    bottom          
    {
        type            symmetryPlane;
    }

    top             
    {
        type            symmetryPlane;
    }

    obstacle
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    defaultFaces    
    {
        type            empty;
    }
}

// ************************************************************************* //
